src/DataProcessors/ПлатежныйКалендарь/ПлатежныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПлатежныйКалендарь</name>
  <attributes>
    <name>ДнейПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНеутвержденные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыПокупателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыПоставщикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратыТоваровОтКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратыТоваровПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедомостиНаВыплатуЗарплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетаНаОплатуПокупателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоступленияПоФинансовойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыПоФинансовойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоступленияПоЭквайрингу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеСумм</name>
    <type>
      <types>EnumRef.ОтображениеСуммВПлатежномКалендаре</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяГруппировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьОтрицательныеСуммы</name>
    <type>
      <types>EnumRef.ОтображениеОтрицательныхСуммВПлатежномКалендаре</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНераспределенныеПоСчетамПоступленияИСписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/ПлатежныйКалендарь/Forms/ФормаНастроек/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.Объект, ИзменяемыеРеквизиты());
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Результат = Новый Структура(ИзменяемыеРеквизиты());
		ЗаполнитьЗначенияСвойств(Результат, Объект);
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИзменяемыеРеквизиты()
	
	Возврат "ОтображатьНеутвержденные, ОтображениеСумм,
			|ЗаказыПокупателей, ЗаказыПоставщикам, ВозвратыТоваровОтКлиента, ВозвратыТоваровПоставщику,
			|ВедомостиНаВыплатуЗарплаты, СчетаНаОплатуПокупателям, ПоступленияПоФинансовойДеятельности,
			|РасходыПоФинансовойДеятельности, ПоступленияПоЭквайрингу,
			|ОтражатьОтрицательныеСуммы";
	
КонецФункции

#КонецОбласти
